In [1]:
import pymysql
import pandas as pd

with open('./db_config.txt') as f:
    res = dict(map(lambda x: x.replace('\n','').split('='), f.readlines()))
    for i, v in res.items():
        if v.isdigit(): res[i] = int(v)
con = pymysql.connect(**res)
cur = con.cursor()
# cur.execute('create table student(id int not null, name varchar(16), email varchar(32), phone varchar(16), major varchar(16))')
table = 'student'
cols = 'id int not null, name varchar(16), email varchar(32), phone varchar(16), major varchar(16)'
cur.execute(f'create table {table}({cols})')

cur.execute('insert into student values(1, "김아무개", "mymail@github.com", "010-1234-1234", "사회과학")')
cur.execute('select * from student')
print('first\n', pd.DataFrame(cur.fetchall()), '\n')
cur.executemany('insert into student values(%s, %s, %s, %s, %s)',
                [[2, '이아무개', 'yourmail@github.com', '010-1234-5678','자연과학'],
                [3, '박아무개', 'theirmail@github.com', '010-5678-5678','인문학']])
cur.execute('select * from student')
print('second\n', pd.DataFrame(cur.fetchall()), '\n')
cur.execute('update student set email="someones@github.com" where id=1')
cur.execute('select * from student')
print('third\n', pd.DataFrame(cur.fetchall()), '\n')
cur.execute('delete from student where id=1')
cur.execute('select * from student')
print('forth\n', pd.DataFrame(cur.fetchall()), '\n')
cur.execute('desc student')
print('fifth\n', pd.DataFrame(cur.fetchall()), '\n')
cur.execute('drop table student')
con.close()

first
    0     1                  2              3     4
0  1  김아무개  mymail@github.com  010-1234-1234  사회과학

second
    0     1                     2              3     4
0  1  김아무개     mymail@github.com  010-1234-1234  사회과학
1  2  이아무개   yourmail@github.com  010-1234-5678  자연과학
2  3  박아무개  theirmail@github.com  010-5678-5678   인문학

third
    0     1                     2              3     4
0  1  김아무개   someones@github.com  010-1234-1234  사회과학
1  2  이아무개   yourmail@github.com  010-1234-5678  자연과학
2  3  박아무개  theirmail@github.com  010-5678-5678   인문학

forth
    0     1                     2              3     4
0  2  이아무개   yourmail@github.com  010-1234-5678  자연과학
1  3  박아무개  theirmail@github.com  010-5678-5678   인문학

fifth
        0            1    2 3     4 5
0     id      int(11)   NO    None
1   name  varchar(16)  YES    None
2  email  varchar(32)  YES    None
3  phone  varchar(16)  YES    None
4  major  varchar(16)  YES    None

In [2]:
from StartSQL import StartSQL

with open('./db_config.txt') as f:
    res = dict(map(lambda x: x.replace('\n','').split('='), f.readlines()))
    for i, v in res.items():
        if v.isdigit(): res[i] = int(v)
tmp = StartSQL(res['user'], res['password'], res['database'])
cols = 'id int not null, name varchar(16), email varchar(32), phone varchar(16), major varchar(16)'
tmp.create_table('student', cols)
tmp.select_table('student')
tmp.insert("1,'김아무개','mymail@github.com','010-1234-1234','사회과학'")
manyList = ["2, '이아무개', 'yourmail@github.com', '010-1234-5678','자연과학'",
            "3, '박아무개', 'theirmail@github.com', '010-5678-5678','인문학'"]  
tmp.insert_many(manyList)
manyList = ["4, 'mail@email.com'", "5, 'mail@email.com'"]
tmp.insert_many(manyList, ['id','email'])

True

In [3]:
tmp.insert('"6", "최아무개", "onesmail@github.com", "010-5678-1234", "공학"')

True

In [4]:
tmp.insert('"7", "박아무개"', ('id','name'))

True

In [5]:
tmp.desc()

       0            1    2 3     4 5
0     id      int(11)   NO    None
1   name  varchar(16)  YES    None
2  email  varchar(32)  YES    None
3  phone  varchar(16)  YES    None
4  major  varchar(16)  YES    None

In [6]:
tmp.select()

   0     1                     2              3     4
0  1  김아무개     mymail@github.com  010-1234-1234  사회과학
1  2  이아무개   yourmail@github.com  010-1234-5678  자연과학
2  3  박아무개  theirmail@github.com  010-5678-5678   인문학
3  4  None        mail@email.com           None  None
4  5  None        mail@email.com           None  None
5  6  최아무개   onesmail@github.com  010-5678-1234    공학
6  7  박아무개                  None           None  None

In [7]:
tmp.select('*',4)

   0     1                     2              3     4
0  1  김아무개     mymail@github.com  010-1234-1234  사회과학
1  2  이아무개   yourmail@github.com  010-1234-5678  자연과학
2  3  박아무개  theirmail@github.com  010-5678-5678   인문학
3  4  None        mail@email.com           None  None

In [8]:
tmp.select('name, id, major',3)

      0  1     2
0  김아무개  1  사회과학
1  이아무개  2  자연과학
2  박아무개  3   인문학

In [9]:
tmp.update('None','email',1)
tmp.select()

   0     1                     2              3     4
0  1  김아무개                  None  010-1234-1234  사회과학
1  2  이아무개   yourmail@github.com  010-1234-5678  자연과학
2  3  박아무개  theirmail@github.com  010-5678-5678   인문학
3  4  None        mail@email.com           None  None
4  5  None        mail@email.com           None  None
5  6  최아무개   onesmail@github.com  010-5678-1234    공학
6  7  박아무개                  None           None  None

In [10]:
tmp.delete(2)
tmp.select()

   0     1                     2              3     4
0  1  김아무개                  None  010-1234-1234  사회과학
1  3  박아무개  theirmail@github.com  010-5678-5678   인문학
2  4  None        mail@email.com           None  None
3  5  None        mail@email.com           None  None
4  6  최아무개   onesmail@github.com  010-5678-1234    공학
5  7  박아무개                  None           None  None

In [11]:
tmp.end()